Revit 2027 API
PrintManager.PrintSetup Property
 The PrintSetup which manages the print settings of current document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PrintSetup PrintSetup { get; }
Public ReadOnly Property PrintSetup As PrintSetup
	Get
public:
property PrintSetup^ PrintSetup {
	PrintSetup^ get ();
}
member PrintSetup : PrintSetup with get
Property Value
PrintSetup
Remarks
 PrintSetup is an interface cluster just like File->Print->Settings->Setup or File->Print Setup in UI.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace